{
  "careerCard" :{
    "CityProvince":"Edmonton, Alberta",
    "Location": "West Edmonton Village",
    "JobTitle": "Day Security Associate",
    "AssType": "Site Staff",
    "ClassificationDesc":"Full Time",
    "Salary":"",
    "PostedDate":"",
    "ReportTo":"Security Associate Level 2",
    "Responsibilities":"Be a visual presence on site to ensure the health, comfort and safety of our Customers  Site visits, patrol on foot exterior and interior property. Inspect all walkways, stairs, water drainage on side of building, building numbers, vacant ground level apartments, trees, tool shed, gravel boxes, benches, office/maintenance shop, garbage bins, fire hydrants, lights, recreational areas, entrances and exits.  Ensure all signs are clearly visible and do not need any repairs.  Inspect parking areas, Look for damaged or abandoned vehicles, license plates with expired plates, or missing plates, visitor parking, pot holes  Replace burnt out lights as needed.  Pick up garbage  Snow removal as required  Touch-up painting as required  Phone check in with Customer Service  Ensure Image Wear is clean, neat and recognizable to customers  Complete all reports and sent them to AC daily  Ensure all correspondence with Customers is noted in Tenant Memo field  Respond to lock out, noise complaints, On Call Maintenance assistance  Complete other tasks assigned by the Area Coordinator  Must have valid Drivers license and vehicle.",
    "Requirements":"Minimum 2 years of Customer Service and or Security Experience required",
    "TechRequirements":"Computer experience is required with web based programs preferred  Ability to learn and adapt quickly to changing systems and new technology",
    "NonTechRequirements": "Strong commitment to providing excellent customer service  Dedicated to building better communities for all our Customers and surrounding communities  Ability to take responsibility for all actions and decisions and to follow through until a resolution is obtained  Excellent listening and telephone etiquette skills   Exceptional problem-solving and decision-making capabilities   Strong planning and organizational skills coupled with ability to multi-task and prioritize  Excellent time-management skills  Ability to handle sensitive and confidential matters  Ability to remain calm and in control of a situation while still maintaining patience, empathy and understanding   Ability to work independently (self managed) and with other Associates in a team environment  Ability to learn quickly, adapt to change and be flexible in nature  Displays a high level of initiative and commitment to success (striving toward Boardwalk’s mission statement)   Demonstrates a positive attitude, enthusiasm and assertiveness  Ability to spend up to eight hours walking, standing, climbing stairs, lifting  Ability to maneuver or lift up to 10kg with the proper equipment",
    "ContactName":"Recruiting",
    "ContactAddress":"200, 8930 Jasper Avenue",
    "ContactPhone":"1-866-686-0982",
    "ApplyEmail":"Recruitingnab@bwalk.com"
  }
}
